In [ ]:
import pandas as pd

In [ ]:
#lendo os arquivos
df1 = pd.read_excel("/content/drive/MyDrive/2be7520c-94cd-463f-8432-d580d0810344/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/MyDrive/2be7520c-94cd-463f-8432-d580d0810344/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/MyDrive/2be7520c-94cd-463f-8432-d580d0810344/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Natal.xlsx")
df4 = pd.read_excel("/content/drive/MyDrive/2be7520c-94cd-463f-8432-d580d0810344/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Recife.xlsx")
df5 = pd.read_excel("/content/drive/MyDrive/2be7520c-94cd-463f-8432-d580d0810344/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Salvador.xlsx")

In [ ]:
#juntando os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [ ]:
#exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
#5 Ãºltimas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [ ]:
#Verificando o tipo dos dados
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
#alterando o tipo de dados
df["LojaID"] = df["LojaID"].astype("object")

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [ ]:
#Verificando se tem valores faltando
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#Substituindo os valores faltes pela mÃ©dia
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [ ]:
#verificando
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#substituindo os valores nulos por zero
df["Vendas"].fillna(0,inplace=True)

In [ ]:
#Apagando as linhas com os valores nulos
df.dropna(how="all", inplace=True)

Criando Colunas

In [ ]:
#Criando coluna de Receitas
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
#Criando coluna Recita/Vendas
df["Receitas/Vendas"] = df["Receita"] / df["Vendas"]

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00              1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26              6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55              1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07              7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08              8.0

In [ ]:
#Descobrindo maior Receita
df["Receita"].max()

3544.0

In [ ]:
#Menor Receita
df["Receita"].min()

3.34

In [ ]:
#nlarges : Retorna um Top n maiores valores,definido da coluna que eu quiser
df.nlargest(3,"Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0              4.0
51  Natal 2018-01-21   859.0    852     4   3436.0              4.0
55  Natal 2019-01-08   859.0    854     4   3436.0              4.0

In [ ]:
#nsmallest : Retorna um Top n menores valores, definido da coluna que eu quiser
df.nsmallest(3,"Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34              1.0
65    Recife 2019-01-01    4.01    981     1     4.01              1.0
92     Natal 2019-01-02    4.57   1035     1     4.57              1.0

In [ ]:
#Agrupamento por cidade. Nesse caso somatÃ³rio de Receita por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
#Ordenando um conjunto de dados. No Ex do maior para o menor, mostrando os 10 primeiros
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0              4.0
55  Natal 2019-01-08   859.0    854     4   3436.0              4.0
51  Natal 2018-01-21   859.0    852     4   3436.0              4.0
30  Natal 2018-10-02   856.0    853     4   3424.0              4.0
41  Natal 2018-05-20   835.0    852     4   3340.0              4.0
38  Natal 2018-02-25   828.0    852     4   3312.0              4.0
10  Natal 2018-10-27   828.0    852     4   3312.0              4.0
69  Natal 2019-03-24   817.0    852     4   3268.0              4.0
62  Natal 2018-02-10   793.0    854     4   3172.0              4.0
52  Natal 2018-04-27   778.0    854     4   3112.0              4.0

Datas

In [ ]:
#Transformando a coluna de Datas em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [ ]:
df.dtypes

Cidade              object
Data                 int64
Vendas             float64
LojaID              object
Qtde                 int64
Receita            float64
Receitas/Vendas    float64
dtype: object

In [ ]:
#Transformando a coluna Datas em tipo Data
df["Data"] = pd.to_datetime(df["Data"])

In [ ]:
df.dtypes

Cidade                     object
Data               datetime64[ns]
Vendas                    float64
LojaID                     object
Qtde                        int64
Receita                   float64
Receitas/Vendas           float64
dtype: object

In [ ]:
#Agrupando por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [ ]:
#Criando uma coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [ ]:
#Pega uma amostra de n linhas
df.sample(5)

       Cidade       Data  Vendas  ...  Receita  Receitas/Vendas  Ano_Venda
59     Recife 2019-01-01   89.39  ...   446.95              5.0       2019
96  Fortaleza 2019-01-01   23.31  ...    93.24              4.0       2019
62     Recife 2019-01-01   23.04  ...   138.24              6.0       2019
86      Natal 2019-01-02  156.47  ...   469.41              3.0       2019
38      Natal 2018-02-25  828.00  ...  3312.00              4.0       2018

[5 rows x 8 columns]

In [ ]:
#Pegando o mÃªs e o dia
df["mes_venda"],df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [ ]:
df.sample(3)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
82      Natal 2019-03-07  868.00  ...      2019          3          7
0   Fortaleza 2019-01-01   45.27  ...      2019          1          1
24      Natal 2018-04-22  868.00  ...      2018          4         22

[3 rows x 10 columns]

In [ ]:
#Achando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [ ]:
#DiferenÃ§a de dias. No Ex. diferenÃ§a do dia da venda para a primeira venda
df["diferenÃ§a_dias"] = df["Data"]-df["Data"].min()

In [ ]:
df.sample(3)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenÃ§a_dias
174      Natal 2019-01-02    35.3  ...         1          2        366 days
224   Salvador 2019-01-02   178.3  ...         1          2        366 days
120  Fortaleza 2019-03-02   184.9  ...         3          2        425 days

[3 rows x 11 columns]

In [ ]:
#Crinado coluna trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [ ]:
df.sample(3)

       Cidade       Data  ...  trimestre+venda trimestre_venda
72   Salvador 2019-01-01  ...                1               1
10      Natal 2018-10-27  ...                4               4
137  Salvador 2019-03-02  ...                1               1

[3 rows x 13 columns]

In [ ]:
#Filtrando por ano e mÃªs. No Ex. Vendasd em 2019 no mÃªs de MarÃ§o
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [ ]:
vendas_marco_19

        Cidade       Data  ...  trimestre+venda trimestre_venda
108  Fortaleza 2019-03-02  ...                1               1
109  Fortaleza 2019-03-02  ...                1               1
110  Fortaleza 2019-03-02  ...                1               1
111  Fortaleza 2019-03-02  ...                1               1
112  Fortaleza 2019-03-02  ...                1               1
..         ...        ...  ...              ...             ...
137   Salvador 2019-03-02  ...                1               1
138   Salvador 2019-03-02  ...                1               1
139   Salvador 2019-03-02  ...                1               1
140   Salvador 2019-03-02  ...                1               1
141   Salvador 2019-03-02  ...                1               1

[121 rows x 13 columns]

VisualizaÃ§Ã£o de Dados